# copyright (C) Vitaly Feskov, 2021


pi = 3.14159265358979323846
e = 2.718281828459045
c = 2.99792458e8
ht = 1.054571817e-34    # постоянная Планка-Дирака
hs = 1.054e-34#27 #6.582119569e-16  # постоянная Планка-Дирака в системе СГС эВ*с
G=6.670e-11
Pik3 = 804.2477
Pik4 = 2.059e5
ze=1.6021892e-19    # заряд электрона в системе Си
se=4.8e-10  #  заряд электрона в системе СГС
me2 = 3.05e-31
ne2 = 2.3e18

M=52*0.007539#0.392#37#1#0.392#0.392#50#120#37#2*0.0904644#0.4674#125#600#1200#2500#1.4208*2#1152#1.4208#5#5000#60#37 #37 #500 #125 #*2*2*10
R=0.175#0.045#0.175#1.5#0.175#0.17#0.25#1.5#0.225#45#0.52#4.8#9.6#10#28#32#0.45#30#0.5#1.5#0.5 #1.5 #0.52 #30
al=52#14#52#548#52#62#10#548#2*12#62#24#120#240#148#12#148#480#12#548 #120 #548 #24
n=1#2#2#1/2#2#1/2#1#2#3#2#1#2#2#1 #2
m=0.007539#0.0676#2*0.007539#5#10#0.007539 # small mass
r=0.005#0.03#0.005#0.03#0.005 # small radius rolik

def Ntau(n):
    if(n==1): return(1)
    return ((e ** (2*n)-1)**0.5)

print('M='+str(M)+' kg')
print('R='+str(R)+' m')
print('al='+str(al))
print('n='+str(n))
Veq = 2.059e5 *((e ** (2*n)-1)**0.5)*ht / (al*me2*1e-3*R)#633# #Pik4 * ((e ** (2*n)-1) * ht / (al*me2*R) # 633 #3330
Vcr = 804.2477 *((e ** (2*n)-1)**0.5)*ht / (al*me2*1e-3*R)#2.5#Pik3 * ((e ** (2*n)-1) * ht / (al*me2*R)
f = Veq/(2*pi*R) 
f_cr = Vcr/(2*pi*R)

Ecr = (M*Vcr*Vcr)/2
Feqцбс=m*Veq*Veq/r

print('Vcr='+str(Vcr)+' m/s')
print('Ecr='+str(Ecr)+' Дж')
print('Veq='+str(Veq)+' m/s')
print('Feqцбс?='+str(Feqцбс)+' ')
print('f_cr='+str(f_cr)+' rps')
print('f='+str(f)+' rps')

Fg = 2*pi*R*((M*c)**2)*(f-f_cr)/(3*ht*(Pik4**10))
e=Pik4*ht*c/(((0.01*0.5e-2)**2)*0.05)
f_2h = f_cr # temporally
H = 4*pi*se*ne2*hs*((f/f_2h)-1)/(c*me2) #*1e-3) #ze = # привести в систему Си ?

print('e?='+str(e)+' ')
print('H='+str(H)+' Tl')
print('Fg='+str(Fg)+' ')
Um=Pik4*(c**3)*ht*Ntau(n)/(2*(Pik4**10)*ze*me2*1e-3*G*1000)
Wrot = ((2*pi*M*R*c)**2)*f*(f-f_cr)/((Pik4**10)*ht*1000)
Feq=Wrot/Veq # Сила разгонная
F1rol=1000*Feq/al # Сила на один Ролик
print('Um='+ str(Um)+' kVolt')
print('Feq='+ str(Feq)+' kN')
print('F1rol='+str(F1rol)+' N')
print('Wrot='+str(Wrot)+' kWt')


